app/controllers/equipments_controller.rb

    def index
        if user_signed_in?
            @equipments=current_user.equipments.all
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."user_id" = $1  [["user_id", 1]]

    def show
        @equipment = Equipment.find(params[:id])
---
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @equipment =Equipment.create(equipment_params)
        @equipment.user = current_user
        if @equipment.save
---
INSERT INTO "equipment" ("name", "description", "time_of_use", "phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Hi"], ["description", "bay"], ["time_of_use", "5"], ["phone", "5.0"], ["created_at", "2020-04-07 13:33:51.866492"], ["updated_at", "2020-04-07 13:33:51.866492"], ["user_id", 1]]
INSERT INTO "equipment" ("name", "description", "time_of_use", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ";;;;"], ["description", "[[["], ["time_of_use", ""], ["created_at", "2020-04-08 14:15:59.439635"], ["updated_at", "2020-04-08 14:15:59.439635"], ["user_id", 3]]

    def edit
        @equipment = Equipment.find(params[:id])
---
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]

   def update
       equipment = Equipment.find(params[:id])
       equipment.update(params.require(:equipment).permit(:name, :description, :time_of_use, :phone))
---
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
UPDATE "equipment" SET "description" = $1, "updated_at" = $2 WHERE "equipment"."id" = $3  [["description", "ooooh"], ["updated_at", "2020-04-08 08:28:28.329625"], ["id", 2]]

    def destroy
         @equipment = Equipment.find(params[:id]).delete
---
DELETE FROM "equipment" WHERE "equipment"."id" = $1  [["id", 1]]
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def find_equipment
        @equipment = Equipment.find(params[:id])
---
SELECT  "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]